avrdudes/avr-libc/include/avr/ioavr32eb20.h
/*
--------------------------------------------------------------------------
TCE - 16-bit Timer/Counter Type E
--------------------------------------------------------------------------
*/

/* 16-bit Timer/Counter Type E */
typedef struct TCE_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t CTRLB;  /* Control B */
    register8_t CTRLC;  /* Control C */
    register8_t CTRLD;  /* Control D */
    register8_t CTRLECLR;  /* Control E Clear */
    register8_t CTRLESET;  /* Control E Set */
    register8_t CTRLFCLR;  /* Control F Clear */
    register8_t CTRLFSET;  /* Control F Set */
    register8_t EVGENCTRL;  /* Event Generation Control */
    register8_t EVCTRL;  /* Event Control */
    register8_t INTCTRL;  /* Interrupt Control */
    register8_t INTFLAGS;  /* Interrupt Flags */
    register8_t reserved_1[2];
    register8_t DBGCTRL;  /* Debug Control */
    register8_t TEMP;  /* Temporary data for 16-bit Access */
    register8_t reserved_2[16];
    _WORDREGISTER(CNT);  /* Count */
    _WORDREGISTER(AMP);  /* Amplitude */
    _WORDREGISTER(OFFSET);  /* Offset */
    _WORDREGISTER(PER);  /* Period */
    _WORDREGISTER(CMP0);  /* Compare 0 */
    _WORDREGISTER(CMP1);  /* Compare 1 */
    _WORDREGISTER(CMP2);  /* Compare 2 */
    _WORDREGISTER(CMP3);  /* Compare 3 */
    register8_t reserved_3[6];
    _WORDREGISTER(PERBUF);  /* Period Buffer */
    _WORDREGISTER(CMP0BUF);  /* Compare 0 Buffer */
    _WORDREGISTER(CMP1BUF);  /* Compare 1 Buffer */
    _WORDREGISTER(CMP2BUF);  /* Compare 2 Buffer */
    _WORDREGISTER(CMP3BUF);  /* Compare 3 Buffer */
} TCE_t;

/* Clock Selection bit group values */
typedef enum TCE_CLKSEL_VALUES_enum
{
    TCE_CLKSEL_DIV1_gv             = 0x00,  /* System Clock */
    TCE_CLKSEL_DIV2_gv             = 0x01,  /* System Clock / 2 */
    TCE_CLKSEL_DIV4_gv             = 0x02,  /* System Clock / 4 */
    TCE_CLKSEL_DIV8_gv             = 0x03,  /* System Clock / 8 */
    TCE_CLKSEL_DIV16_gv            = 0x04,  /* System Clock / 16 */
    TCE_CLKSEL_DIV64_gv            = 0x05,  /* System Clock / 64 */
    TCE_CLKSEL_DIV256_gv           = 0x06,  /* System Clock / 256 */
    TCE_CLKSEL_DIV1024_gv          = 0x07   /* System Clock / 1024 */
} TCE_CLKSEL_values_t;

/* Clock Selection bit group configurations*/
typedef enum TCE_CLKSEL_enum
{
    TCE_CLKSEL_DIV1_gc             = (TCE_CLKSEL_DIV1_gv << TCE_CLKSEL_gp),  /* System Clock */
    TCE_CLKSEL_DIV2_gc             = (TCE_CLKSEL_DIV2_gv << TCE_CLKSEL_gp),  /* System Clock / 2 */
    TCE_CLKSEL_DIV4_gc             = (TCE_CLKSEL_DIV4_gv << TCE_CLKSEL_gp),  /* System Clock / 4 */
    TCE_CLKSEL_DIV8_gc             = (TCE_CLKSEL_DIV8_gv << TCE_CLKSEL_gp),  /* System Clock / 8 */
    TCE_CLKSEL_DIV16_gc            = (TCE_CLKSEL_DIV16_gv << TCE_CLKSEL_gp),  /* System Clock / 16 */
    TCE_CLKSEL_DIV64_gc            = (TCE_CLKSEL_DIV64_gv << TCE_CLKSEL_gp),  /* System Clock / 64 */
    TCE_CLKSEL_DIV256_gc           = (TCE_CLKSEL_DIV256_gv << TCE_CLKSEL_gp),  /* System Clock / 256 */
    TCE_CLKSEL_DIV1024_gc          = (TCE_CLKSEL_DIV1024_gv << TCE_CLKSEL_gp)   /* System Clock / 1024 */
} TCE_CLKSEL_t;

/* Command select bit group values */
typedef enum TCE_CMD_VALUES_enum
{
    TCE_CMD_NONE_gv                = 0x00,  /* No Command */
    TCE_CMD_UPDATE_gv              = 0x01,  /* Force Update */
    TCE_CMD_RESTART_gv             = 0x02,  /* Force Restart */
    TCE_CMD_RESET_gv               = 0x03   /* Force Hard Reset */
} TCE_CMD_values_t;

/* Command select bit group configurations*/
typedef enum TCE_CMD_enum
{
    TCE_CMD_NONE_gc                = (TCE_CMD_NONE_gv << TCE_CMD_gp),  /* No Command */
    TCE_CMD_UPDATE_gc              = (TCE_CMD_UPDATE_gv << TCE_CMD_gp),  /* Force Update */
    TCE_CMD_RESTART_gc             = (TCE_CMD_RESTART_gv << TCE_CMD_gp),  /* Force Restart */
    TCE_CMD_RESET_gc               = (TCE_CMD_RESET_gv << TCE_CMD_gp)   /* Force Hard Reset */
} TCE_CMD_t;

/* Compare # Event select bit group values */
typedef enum TCE_CMP0EV_VALUES_enum
{
    TCE_CMP0EV_PULSE_gv            = 0x00,  /* Event output for CMP is a pulse */
    TCE_CMP0EV_WAVEFORM_gv         = 0x01   /* Event output for CMP is equal to waveform */
} TCE_CMP0EV_values_t;

/* Compare # Event select bit group configurations*/
typedef enum TCE_CMP0EV_enum
{
    TCE_CMP0EV_PULSE_gc            = (TCE_CMP0EV_PULSE_gv << TCE_CMP0EV_bp),  /* Event output for CMP is a pulse */
    TCE_CMP0EV_WAVEFORM_gc         = (TCE_CMP0EV_WAVEFORM_gv << TCE_CMP0EV_bp)   /* Event output for CMP is equal to waveform */
} TCE_CMP0EV_t;

/* Compare # Event select bit group values */
typedef enum TCE_CMP1EV_VALUES_enum
{
    TCE_CMP1EV_PULSE_gv            = 0x00,  /* Event output for CMP is a pulse */
    TCE_CMP1EV_WAVEFORM_gv         = 0x01   /* Event output for CMP is equal to waveform */
} TCE_CMP1EV_values_t;

/* Compare # Event select bit group configurations*/
typedef enum TCE_CMP1EV_enum
{
    TCE_CMP1EV_PULSE_gc            = (TCE_CMP1EV_PULSE_gv << TCE_CMP1EV_bp),  /* Event output for CMP is a pulse */
    TCE_CMP1EV_WAVEFORM_gc         = (TCE_CMP1EV_WAVEFORM_gv << TCE_CMP1EV_bp)   /* Event output for CMP is equal to waveform */
} TCE_CMP1EV_t;

/* Compare # Event select bit group values */
typedef enum TCE_CMP2EV_VALUES_enum
{
    TCE_CMP2EV_PULSE_gv            = 0x00,  /* Event output for CMP is a pulse */
    TCE_CMP2EV_WAVEFORM_gv         = 0x01   /* Event output for CMP is equal to waveform */
} TCE_CMP2EV_values_t;

/* Compare # Event select bit group configurations*/
typedef enum TCE_CMP2EV_enum
{
    TCE_CMP2EV_PULSE_gc            = (TCE_CMP2EV_PULSE_gv << TCE_CMP2EV_bp),  /* Event output for CMP is a pulse */
    TCE_CMP2EV_WAVEFORM_gc         = (TCE_CMP2EV_WAVEFORM_gv << TCE_CMP2EV_bp)   /* Event output for CMP is equal to waveform */
} TCE_CMP2EV_t;

/* Compare # Event select bit group values */
typedef enum TCE_CMP3EV_VALUES_enum
{
    TCE_CMP3EV_PULSE_gv            = 0x00,  /* Event output for CMP is a pulse */
    TCE_CMP3EV_WAVEFORM_gv         = 0x01   /* Event output for CMP is equal to waveform */
} TCE_CMP3EV_values_t;

/* Compare # Event select bit group configurations*/
typedef enum TCE_CMP3EV_enum
{
    TCE_CMP3EV_PULSE_gc            = (TCE_CMP3EV_PULSE_gv << TCE_CMP3EV_bp),  /* Event output for CMP is a pulse */
    TCE_CMP3EV_WAVEFORM_gc         = (TCE_CMP3EV_WAVEFORM_gv << TCE_CMP3EV_bp)   /* Event output for CMP is equal to waveform */
} TCE_CMP3EV_t;

/* Direction select bit group values */
typedef enum TCE_DIR_VALUES_enum
{
    TCE_DIR_UP_gv                  = 0x00,  /* Count up */
    TCE_DIR_DOWN_gv                = 0x01   /* Count down */
} TCE_DIR_values_t;

