avrdudes/avr-libc/include/avr/ioavr32eb20.h
/* Waveform Generation Mode select bit group values */
typedef enum TCF_WGMODE_VALUES_enum
{
    TCF_WGMODE_FRQ_gv              = 0x00,  /* Frequency */
    TCF_WGMODE_NCOPF_gv            = 0x01,  /* Numerically Controlled Oscillator Pulse-Frequency */
    TCF_WGMODE_NCOFDC_gv           = 0x02,  /* Numerically Controlled Oscillator Fixed Duty Cycle */
    TCF_WGMODE_PWM8_gv             = 0x07   /* 8-bit PWM */
} TCF_WGMODE_values_t;

/* Waveform Generation Mode select bit group configurations*/
typedef enum TCF_WGMODE_enum
{
    TCF_WGMODE_FRQ_gc              = (TCF_WGMODE_FRQ_gv << TCF_WGMODE_gp),  /* Frequency */
    TCF_WGMODE_NCOPF_gc            = (TCF_WGMODE_NCOPF_gv << TCF_WGMODE_gp),  /* Numerically Controlled Oscillator Pulse-Frequency */
    TCF_WGMODE_NCOFDC_gc           = (TCF_WGMODE_NCOFDC_gv << TCF_WGMODE_gp),  /* Numerically Controlled Oscillator Fixed Duty Cycle */
    TCF_WGMODE_PWM8_gc             = (TCF_WGMODE_PWM8_gv << TCF_WGMODE_gp)   /* 8-bit PWM */
} TCF_WGMODE_t;

/* Waveform Generation Pulse Length select bit group values */
typedef enum TCF_WGPULSE_VALUES_enum
{
    TCF_WGPULSE_CLK1_gv            = 0x00,  /* High pulse duration is 1 clock period */
    TCF_WGPULSE_CLK2_gv            = 0x01,  /* High pulse duration is 2 clock period */
    TCF_WGPULSE_CLK4_gv            = 0x02,  /* High pulse duration is 4 clock period */
    TCF_WGPULSE_CLK8_gv            = 0x03,  /* High pulse duration is 8 clock period */
    TCF_WGPULSE_CLK16_gv           = 0x04,  /* High pulse duration is 16 clock period */
    TCF_WGPULSE_CLK32_gv           = 0x05,  /* High pulse duration is 32 clock period */
    TCF_WGPULSE_CLK64_gv           = 0x06,  /* High pulse duration is 64 clock period */
    TCF_WGPULSE_CLK128_gv          = 0x07   /* High pulse duration is 128 clock period */
} TCF_WGPULSE_values_t;

/* Waveform Generation Pulse Length select bit group configurations*/
typedef enum TCF_WGPULSE_enum
{
    TCF_WGPULSE_CLK1_gc            = (TCF_WGPULSE_CLK1_gv << TCF_WGPULSE_gp),  /* High pulse duration is 1 clock period */
    TCF_WGPULSE_CLK2_gc            = (TCF_WGPULSE_CLK2_gv << TCF_WGPULSE_gp),  /* High pulse duration is 2 clock period */
    TCF_WGPULSE_CLK4_gc            = (TCF_WGPULSE_CLK4_gv << TCF_WGPULSE_gp),  /* High pulse duration is 4 clock period */
    TCF_WGPULSE_CLK8_gc            = (TCF_WGPULSE_CLK8_gv << TCF_WGPULSE_gp),  /* High pulse duration is 8 clock period */
    TCF_WGPULSE_CLK16_gc           = (TCF_WGPULSE_CLK16_gv << TCF_WGPULSE_gp),  /* High pulse duration is 16 clock period */
    TCF_WGPULSE_CLK32_gc           = (TCF_WGPULSE_CLK32_gv << TCF_WGPULSE_gp),  /* High pulse duration is 32 clock period */
    TCF_WGPULSE_CLK64_gc           = (TCF_WGPULSE_CLK64_gv << TCF_WGPULSE_gp),  /* High pulse duration is 64 clock period */
    TCF_WGPULSE_CLK128_gc          = (TCF_WGPULSE_CLK128_gv << TCF_WGPULSE_gp)   /* High pulse duration is 128 clock period */
} TCF_WGPULSE_t;

/* Waveform Output # Polarity select bit group values */
typedef enum TCF_WO0POL_VALUES_enum
{
    TCF_WO0POL_NORMAL_gv           = 0x00,  /* Waveform output set on update and cleared on match */
    TCF_WO0POL_INVERSE_gv          = 0x01   /* Waveform output cleared on update and set on match */
} TCF_WO0POL_values_t;

/* Waveform Output # Polarity select bit group configurations*/
typedef enum TCF_WO0POL_enum
{
    TCF_WO0POL_NORMAL_gc           = (TCF_WO0POL_NORMAL_gv << TCF_WO0POL_bp),  /* Waveform output set on update and cleared on match */
    TCF_WO0POL_INVERSE_gc          = (TCF_WO0POL_INVERSE_gv << TCF_WO0POL_bp)   /* Waveform output cleared on update and set on match */
} TCF_WO0POL_t;

/* Waveform Output # Polarity select bit group values */
typedef enum TCF_WO1POL_VALUES_enum
{
    TCF_WO1POL_NORMAL_gv           = 0x00,  /* Waveform output set on update and cleared on match */
    TCF_WO1POL_INVERSE_gv          = 0x01   /* Waveform output cleared on update and set on match */
} TCF_WO1POL_values_t;

/* Waveform Output # Polarity select bit group configurations*/
typedef enum TCF_WO1POL_enum
{
    TCF_WO1POL_NORMAL_gc           = (TCF_WO1POL_NORMAL_gv << TCF_WO1POL_bp),  /* Waveform output set on update and cleared on match */
    TCF_WO1POL_INVERSE_gc          = (TCF_WO1POL_INVERSE_gv << TCF_WO1POL_bp)   /* Waveform output cleared on update and set on match */
} TCF_WO1POL_t;

/*
--------------------------------------------------------------------------
TWI - Two-Wire Interface
--------------------------------------------------------------------------
*/

/* Two-Wire Interface */
typedef struct TWI_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t DUALCTRL;  /* Dual Mode Control */
    register8_t DBGCTRL;  /* Debug Control */
    register8_t MCTRLA;  /* Host Control A */
    register8_t MCTRLB;  /* Host Control B */
    register8_t MSTATUS;  /* Host STATUS */
    register8_t MBAUD;  /* Host Baud Rate */
    register8_t MADDR;  /* Host Address */
    register8_t MDATA;  /* Host Data */
    register8_t SCTRLA;  /* Client Control A */
    register8_t SCTRLB;  /* Client Control B */
    register8_t SSTATUS;  /* Client Status */
    register8_t SADDR;  /* Client Address */
    register8_t SDATA;  /* Client Data */
    register8_t SADDRMASK;  /* Client Address Mask */
    register8_t reserved_1[1];
} TWI_t;

/* Acknowledge Action select bit group values */
typedef enum TWI_ACKACT_VALUES_enum
{
    TWI_ACKACT_ACK_gv              = 0x00,  /* Send ACK */
    TWI_ACKACT_NACK_gv             = 0x01   /* Send NACK */
} TWI_ACKACT_values_t;

/* Acknowledge Action select bit group configurations*/
typedef enum TWI_ACKACT_enum
{
    TWI_ACKACT_ACK_gc              = (TWI_ACKACT_ACK_gv << TWI_ACKACT_bp),  /* Send ACK */
    TWI_ACKACT_NACK_gc             = (TWI_ACKACT_NACK_gv << TWI_ACKACT_bp)   /* Send NACK */
} TWI_ACKACT_t;

/* Address or Stop select bit group values */
typedef enum TWI_AP_VALUES_enum
{
    TWI_AP_STOP_gv                 = 0x00,  /* A Stop condition generated the interrupt on APIF flag */
    TWI_AP_ADR_gv                  = 0x01   /* Address detection generated the interrupt on APIF flag */
} TWI_AP_values_t;

/* Address or Stop select bit group configurations*/
typedef enum TWI_AP_enum
{
    TWI_AP_STOP_gc                 = (TWI_AP_STOP_gv << TWI_AP_bp),  /* A Stop condition generated the interrupt on APIF flag */
    TWI_AP_ADR_gc                  = (TWI_AP_ADR_gv << TWI_AP_bp)   /* Address detection generated the interrupt on APIF flag */
} TWI_AP_t;

